qa/mutants/missing_mixed_phase_fir/scope.diff
--- a/crates/roomeq-workflow/src/room_optimization.rs
+++ b/crates/roomeq-workflow/src/room_optimization.rs
@@ -2074 +2074 @@
-    if processing_mode == ProcessingMode::MixedPhase {
+    if processing_mode != ProcessingMode::MixedPhase {
